Repository: oliver-49/DPEI-Project
Catalog: lib/l10n/app_*.arb
Languages: ar

# error_loading
source: Error loading provider data
ar: حدث خطأ أثناء تحميل البيانات

# welcome_title
source: Welcome to FixIt
ar: مرحبًا بك في FixIt

# welcome_subtitle
source: Discover a world of convenience and reliability. FixIt is your one stop solution for all your home service needs.
ar: اكتشف عالم من الراحة والموثوقية. FixIt هو الحل الشامل لكل احتياجاتك المنزلية.

# find_services_title
source: Find Services
ar: ابحث عن الخدمات

# find_services_subtitle
source: Browse and book a wide range of services from plumbing and electrical to appliance repair. We’ve got it all covered.
ar: تصفح واحجز مجموعة واسعة من الخدمات من السباكة والكهرباء إلى إصلاح الأجهزة. كل ما تحتاجه متوفر.

# fast_reliable_title
source: Fast & Reliable
ar: سريع وموثوق

# fast_reliable_subtitle
source: Our professionals ensure quick and reliable service every time. Sit back and relax, we’ve got you covered.
ar: يضمن محترفونا خدمة سريعة وموثوقة في كل مرة. استرخِ ودعنا نعتني بالأمر.

source: Skip
ar: تخطي

source: Get Started
ar: ابدأ الآن

# login_title
source: Enter your email and password to login
ar: أدخل بريدك الإلكتروني وكلمة المرور لتسجيل الدخول

# email_label
source: Enter your email
ar: أدخل بريدك الإلكتروني

# email_required
source: Please enter your email
ar: من فضلك أدخل بريدك الإلكتروني

# email_invalid_at
source: Email must contain @
ar: يجب أن يحتوي البريد الإلكتروني على @

# email_invalid_com
source: Email must end with .com
ar: يجب أن ينتهي البريد الإلكتروني بـ .com

# password_label
source: Enter password
ar: أدخل كلمة المرور

# password_required
source: Please enter your password
ar: من فضلك أدخل كلمة المرور

# password_short
source: Password must be at least 6 characters long
ar: يجب أن تتكون كلمة المرور من 6 أحرف على الأقل

source: Forgot Password?
ar: هل نسيت كلمة المرور؟

source: Sign In
ar: تسجيل الدخول

# login_success
source: Logged in successfully
ar: تم تسجيل الدخول بنجاح

# login_invalid_data
source: Please, input valid data
ar: من فضلك أدخل بيانات صحيحة

source: New to FixIt?
ar: جديد في FixIt؟

source: Sign Up now
ar: أنشئ حسابًا الآن

source: Or
ar: أو

source: Log in with
ar: تسجيل الدخول باستخدام

source: Google
ar: جوجل

source: Facebook
ar: فيسبوك

# signup_title
source: Enter your email and password to sign up
ar: أدخل بريدك الإلكتروني وكلمة المرور للتسجيل

source: Full name
ar: الاسم الكامل

# agree_terms
source: I Agree With FixIt’s
ar: أوافق على

# terms_conditions
source: Term & Conditions
ar: الشروط والأحكام الخاصة بـ FixIt

source: Sign Up
ar: إنشاء حساب

# account_created
source: Account created successfully
ar: تم إنشاء الحساب بنجاح

# already_have_account
source: Already have an account?
ar: هل لديك حساب بالفعل؟

source: Sign in now
ar: سجّل الدخول الآن

source: Sign up with
ar: سجّل باستخدام

# accountSetupTitle
source: I am
ar: أنا

# roleProviderTitle
source: Service Provider
ar: مزود خدمة

# roleProviderSubtitle
source: I offer professional services
ar: أقدم خدمات احترافية

# roleCustomerTitle
source: Looking for service
ar: باحث عن خدمة

# roleCustomerSubtitle
source: I am looking for home services.
ar: أبحث عن خدمات منزلية.

# nextButton
source: Next
ar: التالي

# enterPhoneTitle
source: Enter your Phone number to verify
ar: أدخل رقم هاتفك للتحقق

# sendCodeButton
source: Send Code
ar: إرسال الكود

# enterPinTitle
source: Enter 5-digit PIN code sent to your phone number
ar: أدخل رمز التحقق المكون من 5 أرقام المرسل إلى رقم هاتفك

# verifyButton
source: Verify
ar: تحقق

source: Did not receive code?
ar: لم تستلم الكود؟

source: Send again
ar: أرسل مرة أخرى

# allowLocationTitle
source: Allow “FixIt” to use your location
ar: اسمح لتطبيق “FixIt” باستخدام موقعك

# allowLocationSubtitle
source: We need to know your exact location so that Clients can find you easily near you.
ar: نحتاج لمعرفة موقعك الدقيق حتى يتمكن العملاء من العثور عليك بسهولة بالقرب منك.

source: Allow Once
ar: السماح مرة واحدة

# allowWhileUsing
source: Allow While Using FixIt
ar: السماح أثناء استخدام FixIt

# donotAllow
source: Don’t Allow
ar: عدم السماح

# continueButton
source: Continue
ar: متابعة

# pleaseAllowLocation
source: Please allow location access to proceed.
ar: يرجى السماح بالوصول إلى الموقع قبل المتابعة

# defaultLocationText
source: No location selected yet
ar: لم يتم تحديد موقع بعد

# businessNameHint
source: Business name
ar: اسم النشاط التجاري

# businessAddressHint
source: Business address
ar: عنوان النشاط التجاري

# errorFillAllFields
source: Please fill in all fields
ar: من فضلك أدخل جميع البيانات

# serviceOfferTitle
source: Service Offer
ar: عرض الخدمة

# selectService
source: Select Your Service
ar: اختر خدمتك

# selectExperience
source: Select Your Experience
ar: اختر خبرتك

source: Select Service Area
ar: اختر منطقة الخدمة

source: Loading...
ar: جارٍ التحميل...

# optionCleaning
source: Cleaning
ar: تنظيف

# optionPlumbing
source: Plumbing
ar: سباكة

# optionElectrical
source: Electrical
ar: كهرباء

# optionBeginner
source: Beginner
ar: مبتدئ

# optionIntermediate
source: Intermediate
ar: متوسط

# optionExpert
source: Expert
ar: خبير

source: Plumbing
ar: سباكة

source: Electricity
ar: كهرباء

source: Cleaning
ar: تنظيف

source: Painting
ar: دهان

source: Gardening
ar: حدائق

source: Cairo
ar: القاهرة

source: Giza
ar: الجيزة

source: Alexandria
ar: الإسكندرية

source: Luxor
ar: الأقصر

source: Aswan
ar: أسوان

source: Suez
ar: السويس

source: Dakahlia
ar: الدقهلية

source: Sharqia
ar: الشرقية

source: Beheira
ar: البحيرة

source: Menofia
ar: المنوفية

source: Minya
ar: المنيا

source: Ismailia
ar: الإسماعيلية

source: Qalyubia
ar: القليوبية

source: Gharbia
ar: الغربية

source: Fayoum
ar: الفيوم

source: Service Working Hours
ar: ساعات عمل الخدمة

source: From
ar: من

source: To
ar: إلى

# documentsTitle
source: We need a few Documents.
ar: نحتاج إلى بعض المستندات

# uploadServiceLicense
source: Upload your service license
ar: ارفع رخصة الخدمة الخاصة بك

# uploadCertification
source: Upload your certification
ar: ارفع شهادتك

source: Upload
ar: رفع

source: Change
ar: تغيير

source: Account Details
ar: تفاصيل الحساب

source: Add Account Details
ar: إضافة تفاصيل الحساب

source: Owner Name
ar: اسم المالك

source: NIC Number
ar: رقم البطاقة القومية

source: Phone Number
ar: رقم الهاتف

source: NIC Expiry Date
ar: تاريخ انتهاء البطاقة

# dateFormat
source: DD/MM/YYYY
ar: يوم/شهر/سنة

source: Submitting...
ar: جاري الإرسال...

source: Next
ar: التالي

# applicationReceived
source: Your application has been received!
ar: تم استلام طلبك بنجاح!

# applicationReceivedMessage
source: Thank you for submitting your application. Our team will review it soon.
ar: شكرًا لتقديمك الطلب، سيتم مراجعته قريبًا من قبل فريقنا.

source: Home
ar: الصفحة الرئيسية

source: My Orders
ar: طلباتي

source: City
ar: المدينة

source: Orders
ar: الطلبات

source: Profile
ar: الملف الشخصي

source: Unpaid
ar: غير مدفوعة

source: Paid
ar: مدفوعة

# schedule
source: Scheduled
ar: مجدولة

# noOrders
source: No Orders Found
ar: لا توجد طلبات

source: EGP
ar: ج.م

# providerName
source: Provider
ar: اسم المزود

source: Date
ar: التاريخ

source: Arrival Time
ar: وقت الوصول

source: Pay Now
ar: ادفع الآن

source: View Receipt
ar: عرض الفاتورة

source: Cancel Booking
ar: إلغاء الحجز

source: Amount to pay
ar: المبلغ المستحق

# unpaidSubtitle
source: You have not paid yet for below service
ar: لم تقم بالدفع بعد للخدمة التالية

# paidSubtitle
source: Paid services
ar: الخدمات المدفوعة

# scheduleSubtitle
source: Upcoming Booking services
ar: الخدمات القادمة

source: Amount to paid
ar: المبلغ المدفوع

source: Booking date
ar: تاريخ الحجز

source: Payment
ar: الدفع

source: Select Payment method
ar: اختر طريقة الدفع

source: Add new card
ar: إضافة بطاقة جديدة

source: Details
ar: التفاصيل

source: Card number
ar: رقم البطاقة

source: Card holder name
ar: اسم صاحب البطاقة

source: Card expiry date
ar: تاريخ انتهاء البطاقة

source: CVV
ar: رمز الأمان CVV

# continueBtn
source: Continue
ar: متابعة

source: hour
ar: ساعة

# hourLabel
source: H
ar: ساعة

# perHour
source: H
ar: ساعة

# enterValidCardNumber
source: Please enter a valid 16-digit card number
ar: من فضلك أدخل رقم بطاقة صحيح مكون من 16 رقم

# enterExpiryDate
source: Please choose an expiry date
ar: من فضلك اختر تاريخ الإنتهاء

# enterValidCvv
source: CVV must be 3 to 4 digits
ar: يجب أن يكون CVV من 3 إلى 4 أرقام

source: Payment successful
ar: تم الدفع بنجاح

source: Payment of
ar: تم دفع مبلغ

# paidSuccessfully
source: has been paid successfully
ar: بنجاح

source: Give Feedback
ar: إرسال تقييم

# howWasExperience
source: How was your experience with Fix it?
ar: كيف كانت تجربتك مع Fix it؟

# writeFeedback
source: Write in the box below
ar: اكتب ملاحظاتك هنا

source: Send
ar: إرسال

source: pay
ar: ادفع

source: Write here...
ar: اكتب هنا...

source: Electric Work
ar: أعمال كهربائية

source: Solar
ar: طاقة شمسية

source: Search Here...
ar: ابحث هنا...

source: Get 30% off
ar: احصل على خصم 30%

# booking_home_services
source: Just by Booking Home Services
ar: بالحجز لخدمات المنزل

# home_booking_services
source: Just by Booking Home Services
ar: بمجرد حجز خدمات المنزل

# home_search_placeholder
source: Search Here..
ar: ابحث هنا..

# home_popular_services
source: Popular Services
ar: الخدمات الشائعة

# home_service_providers
source: Service Providers
ar: مقدمي الخدمات

source: Maskot Kota
ar: ماسكت كوتا

source: Shams Jan
ar: شمس جان

# nav_home
source: Home
ar: الرئيسية

# nav_order
source: Order
ar: الطلبات

# nav_profile
source: Profile
ar: الملف الشخصي

source: Popular Services
ar: الخدمات الشائعة

source: Maintenance
ar: صيانة

source: Home Improvement
ar: تحسين المنزل

source: Security
ar: أمن

source: Car Maintenance
ar: صيانة السيارات

source: Handyman Services
ar: خدمات الحرفيين

source: Other Services
ar: خدمات أخرى

source: Electrician
ar: فني كهرباء

source: Carpenter
ar: نجار

source: Painter
ar: دهان

source: Cleaner
ar: عامل نظافة

source: Locksmith
ar: فني أقفال

source: Jackson
ar: جاكسون

source: Ethan Lita
ar: إيثان ليتا

source: Isabella Una
ar: إيزابيلا أونا

source: Aiden
ar: آيدن

source: Logan
ar: لوغان

source: Lucas
ar: لوكاس

source: Ethan
ar: إيثان

source: Harper
ar: هاربر

source: Caleb
ar: كاليب

source: Benjamin
ar: بنجامين

source: Carter
ar: كارتر

source: Air Condition
ar: تكييف

source: Electric
ar: كهرباء

source: Siding Repair
ar: إصلاح الجوانب

source: Car Wash
ar: غسيل السيارات

source: Home Flooring
ar: أرضيات المنزل

source: Gutter
ar: مزاريب

source: Carpet
ar: سجاد

source: Pliers
ar: كماشة

source: Drilling
ar: حفر

source: Lawn
ar: عشب

source: Weed Control
ar: مكافحة الأعشاب

source: Water Tap
ar: حنفية

source: Cameras
ar: كاميرات

source: Burglar Alarm
ar: إنذار ضد السرقة

source: Sturdy Lock
ar: قفل متين

source: CCTV
ar: كاميرات مراقبة

source: Car Washer
ar: غسالة سيارات

source: Oil Change
ar: تغيير الزيت

source: Car Battery
ar: بطارية السيارة

source: Furniture
ar: أثاث

source: Door
ar: باب

source: Shelving
ar: أرفف

source: Interior
ar: الداخلية

source: Exterior
ar: الخارجية

source: Wall
ar: حائط

source: Dish Wash
ar: غسيل الصحون

source: Cutting
ar: قص

source: Mopping Floor
ar: كنس الأرضية

source: Rating
ar: التقييم

# no_providers
source: No providers available at the moment.
ar: لا يوجد مزودين في الوقت الحالي.

source: Loading providers...
ar: جاري تحميل المزودين...

source: Provider Details
ar: تفاصيل المزود

source: Service Type
ar: نوع الخدمة

source: Services Providers
ar: مزودي الخدمات

source: Electrician Providers
ar: مزودي الكهرباء

source: Plumber Providers
ar: مزودي السباكة

source: Carpenter Providers
ar: مزودي النجارة

source: Painter Providers
ar: مزودي الطلاء

source: Cleaner Providers
ar: مزودي التنظيف

source: Locksmith Providers
ar: مزودي الأقفال

source: Name
ar: الاسم

source: Emily jani
ar: إميلي جاني

source: Plumber
ar: سباك

# rate
source: Rating
ar: التقيم

# order
source: 56 Orders
ar: 56 طلب

# complete
source: Completed
ar: مكتمل

# years
source: 3 Years
ar: 3 سنوات

source: Experience
ar: خبرة

source: Skills
ar: مهارات

source: Sink
ar: حوض

source: Shower
ar: دش

source: Boiler
ar: غلايه

source: Toilet
ar: مرحاض

source: Book
ar: حجز

source: Bio
ar: السيرة الذاتية

# bioDescription
source: I'm Emily Jani, a dedicated plumbing professional with a passion for delivering top notch service to ensure your home's plumbing runs smoothly. With years of hands-on experience.
ar: أنا إميلي جاني، سباك متفاني، شغوف بتقديم خدمة ممتازة لضمان سير أعمال السباكة في منزلك بسلاسة. بخبرة عملية تمتد لسنوات.

# gallary
source: Gallery
ar: المعرض

source: View all
ar: عرض الكل

source: Review
ar: مراجعة

# nameUser
source: yousef
ar: يوسف

# comment
source: Emily Jani exceeded my expectations! Quick, reliable, and fixed my plumbing issue with precision. Highly recommend.
ar: لقد فاق إميلي جاني توقعاتي! سريع وموثوق، وأصلح مشكلة السباكة بدقة. أنصح به بشدة.

# bookPlumber
source: Plumber booking
ar: حجز سباك

# allowForFixit
source: Allow “FixIt” to use your location
ar: السماح لـ Fixlt باستخدام موقعك

# weAreNeedToKnowYourLocation
source: We need to know your exact location so that The electrician can visit you easily.
ar: نحن بحاجة إلى معرفة موقعك الدقيق حتى يتمكن الكهربائي من زيارتك بسهولة.

# allowDuringUsingFixit
source: Allow While Using FixIt
ar: السماح أثناء استخدام FixIt

source: Don’t Allow
ar: لا تسمح

source: Fill Manually
ar: املأ يدويًا

# enterYourLocation
source: Enter your location address
ar: أدخل عنوان موقعك

# houseNumber
source: Enter house number
ar: أدخل رقم المنزل

# streetNumber
source: Enter street number
ar: أدخل رقم الشارع

# fullLocation
source: Enter street number
ar: أدخل العنوان الكامل

source: Success
ar: نجاح

# locationIsAdded
source: Your address has been successfully added.
ar: تم اضافه عنوان موقعك بنجاح

source: Error
ar: خطا

# pleaseEnterVaildData
source: Please enter correct information.
ar: من فضلك ادخل بيانات صحيحه

source: Select Date
ar: حدد التاريخ

# selectHour
source: Select Hours
ar: حدد الساعة

source: The date has been added successfully.
ar: تم اضافه التاريخ بنجاح

# pleaseSelectTime
source: Please select a time.
ar: من فضلك اختر الوقت

source: AM
ar: صباحا

source: PM
ar: مساء

source: Review Summary
ar: ملخص الحجز

# craftsmanType
source: Type
ar: النوع

# salary
source: Price
ar: السعر

source: Address
ar: العنوان

# fullAddressFormat
source: {fullAddress}/House No {homeNo}/Street No {streetNo}
ar: {fullAddress}/منزل رقم {homeNo}/شارع رقم {streetNo}

# bookingHour
source: Booking Hours
ar: ساعة الحجز

source: Total
ar: الاجمالي

source: Confirm
ar: تأكيد

# orderRecive
source: Order received
ar: تم استلام الطلب

# plumberArrival
source: Based on your booking request received by the plumber, he will arrive at {time}.
ar: بناءً على طلبك للحجز الذي تلقاه السباك، سيصل السباك في الساعة {time}.

# selectVerifcationMethod
source: Select Verification method
ar: اختر طريقة التحقق

source: Email
ar: البريد الإلكترون

# phone
source: Mobile number
ar: رقم الجوال

# enterEmail
source: Enter your Email address to verify
ar: أدخل عنوان بريدك الإلكتروني للتحقق

source: Send Code
ar: إرسال الرمز

source: Please enter your email
ar: الرجاء إدخال بريدك الإلكتروني

# enterValidEmailAddress
source: Enter a valid email address
ar: أدخل عنوان البريد الإلكتروني صحيح

source: code sends successfully
ar: تم إرسال الكود بنجاح

# enter5digit
source: Enter 5-digit PIN code sent to your Email address
ar: أدخل رمز PIN المكون من 5 أرقام المُرسل إلى بريدك الإلكتروني

source: the code is correct
ar: الكود صحيح

source: Verify
ar: التحقق

# didNotRecivedCode
source: Did not received code?
ar: ألم تستلم الرمز؟

# createPassword
source: Create new password
ar: أنشئ كلمة مرور جديدة

source: New Password
ar: كلمة مرور جديدة

source: Confirm Password
ar: تأكيد كلمة المرور

source: Save
ar: حفظ

source: Password updated successfully
ar: تم تحديث كلمة المرور بنجاح

source: Edit Profile
ar: تعديل الملف الشخصي

source: Country
ar: الدولة

source: Phone number
ar: رقم الهاتف

source: egy
ar: مصر

source: Egypt
ar: مصر

source: Mexico
ar: المكسيك

source: USA
ar: الولايات المتحدة

source: Canada
ar: كندا

source: Other
ar: أخرى

source: Profession
ar: المهنة

source: Verification
ar: التحقق

source: Subscription & payments
ar: الاشتراك والمدفوعات

source: Payment method
ar: طريقة الدفع

source: Upgrade
ar: ترقية

source: General Preferences
ar: التفضيلات العامة

source: Notification
ar: الإشعارات

source: Help & support
ar: المساعدة والدعم

source: Logout
ar: تسجيل الخروج

source: Confirm Logout
ar: تأكيد تسجيل الخروج

# logout_confirmation
source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Cancel
ar: إلغاء

# change_profile_mode
source: Change Profile to buying mode
ar: تغيير الملف الشخصي إلى وضع الشراء

source: Earnings
ar: الأرباح

source: Active
ar: نشط

source: Completed
ar: مكتمل

source: Profile information
ar: معلومات الملف الشخص

source: Service name
ar: اسم الخدمة

source: Expert in
ar: خبير في

source: Service Timing
ar: مواعيد الخدمة

source: Experience in years
ar: عدد سنوات الخبرة

source: Service Area
ar: منطقة الخدمة

# upload_services_license
source: Upload your services license
ar: رفع رخصة الخدمة

# upload_certification
source: Upload your Certification
ar: رفع الشهادة

# order_success_title
source: You placed the order successfully
ar: تم تنفيذ الطلب بنجاح

# order_failed_title
source: Your order has been canceled
ar: تم إلغاء الطلب

# order_success_status
source: successfully
ar: بنجاح

# order_failed_status
source: failed
ar: فشل

source: Back to Home
ar: ارجع إلى الصفحة الرئيسية

# payment_page_title
source: Payment Page
ar: صفحة الدفع

# payment_loading
source: Redirecting to payment...
ar: جارٍ فتح صفحة الدفع...

# payment_error_title
source: Error
ar: خطأ

# payment_error_message
source: Payment error occurred: {error}
ar: حدث خطأ في الدفع: {error}

# payment_success_title
source: Success
ar: نجاح

# payment_success_message
source: ✅ Payment completed successfully
ar: ✅ تم الدفع بنجاح

# payment_failed_title
source: Failed
ar: فشل

# payment_failed_message
source: ❌ Payment failed
ar: ❌ فشل في الدفع

# close_button_tooltip
source: Close
ar: إغلاق

# payment_auth_error
source: Failed to get authentication token.
ar: فشل في الحصول على رمز المصادقة.

# payment_order_error
source: Failed to create payment order.
ar: فشل في إنشاء الطلب.

# payment_key_error
source: Failed to get payment key.
ar: فشل في الحصول على مفتاح الدفع.

# payment_general_error
source: Error in PaymobManager: {error}
ar: حدث خطأ في PaymobManager: {error}

# payment_failed_to_get_key
source: Failed to get payment key
ar: فشل الحصول على مفتاح الدفع

# change_to_selling_mode
source: Change Profile to selling mode
ar: تبديل الملف إلى وضع البيع

# logout_title
source: Logout
ar: تسجيل الخروج

# logout_button
source: Logout
ar: تسجيل الخروج

# cancel_button
source: Cancel
ar: إلغاء

source: My Profile
ar: ملفي الشخصي

source: + Add new card
ar: + أضف بطاقة جديدة

source: Mahrama
ar: محرمًا

source: Select Payment method
ar: اختر طريقة الدفع

source: Easypaisa
ar: إيزي باي

source: Bank account
ar: الحساب البنكي

source: Jazz cash
ar: جاز كاش

source: PayPal
ar: باي بال

# payment_saved
source: saved successfully!
ar: تم حفظ بنجاح!

# please_select_payment
source: Please select a payment method
ar: الرجاء اختيار طريقة الدفع

source: General notification
ar: الإشعارات العامة

source: Sound
ar: الصوت

source: Vibrate
ar: الاهتزاز

source: New Service
ar: خدمة جديدة

# notification_saved
source: Notification settings saved successfully!
ar: تم حفظ إعدادات الإشعارات بنجاح!

source: Home clean, lawn clean, washing
ar: تنظيف المنزل، تنظيف الحديقة، الغسيل

source: Home Screen
ar: الشاشة الرئيسية

source: City Screen
ar: شاشة المدينة

source: Order Screen
ar: شاشة الطلبات

source: Live chat
ar: الدردشة المباشرة

# hello_assist
source: Hello, how can we assist you?
ar: مرحبًا، كيف يمكننا مساعدتك؟

source: Title
ar: العنوان

# title_hint
source: Enter the title of your issue
ar: أدخل عنوان المشكلة

# description
source: Write in bellow box
ar: اكتب في الصندوق أدناه

# description_hint
source: Write here...
ar: اكتب هنا...

# enter_title
source: Please enter a title for your issue
ar: يرجى إدخال عنوان المشكلة

# enter_description
source: Please describe your issue
ar: يرجى وصف المشكلة

# ticket_submitted
source: Your issue has been submitted successfully!
ar: تم إرسال المشكلة بنجاح!

# dob
source: Date of Birth
ar: تاريخ الميلاد

source: Select Country
ar: اختر الدولة

source: Select Country Code
ar: اختر كود الدولة

# changes_saved
source: Changes saved successfully
ar: تم حفظ التعديلات بنجاح

source: Card
ar: بطاقة

source: Credit card
ar: بطاقة ائتمان

source: Card number
ar: رقم البطاقة

# card_number_hint
source: Enter 14 digit number
ar: أدخل رقم مكون من 14 رقم

source: Card holder name
ar: اسم حامل البطاقة

# card_holder_name_hint
source: Enter name
ar: أدخل الاسم

source: Card expiry date
ar: تاريخ انتهاء البطاقة

# card_expiry_date_hint
source: DD/MM/YYYY
ar: يوم/شهر/سنة

source: Pick Image Example
ar: مثال اختيار صورة

source: No image selected
ar: لم يتم اختيار صورة

source: Pick Image
ar: اختر صورة

source: Camera
ar: الكاميرا

# payment_success
source: ✅ Payment Successful
ar: ✅ الدفع تم بنجاح

source: ❌ Payment Failed
ar: ❌ فشل في الدفع

# close_button
source: Close
ar: إغلاق

# dob_label
source: Date of Birth
ar: تاريخ الميلاد

# select_country_title
source: Select Country
ar: اختر الدولة

# select_country_code_title
source: Select Country Code
ar: اختر كود الدولة

# data_saved_success
source: Changes saved successfully
ar: تم حفظ التغييرات بنجاح

# data_saved_console
source: Data saved
ar: تم حفظ البيانات

# success_message
source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

# choose_date_hint
source: Choose your date of birth
ar: اختر تاريخ ميلادك

# uk
source: United Kingdom
ar: المملكة المتحدة

source: Germany
ar: ألمانيا

source: France
ar: فرنسا

source: Italy
ar: إيطاليا

source: Spain
ar: إسبانيا

source: Japan
ar: اليابان

source: Brazil
ar: البرازيل

source: Australia
ar: أستراليا

source: India
ar: الهند

source: China
ar: الصين

source: South Korea
ar: كوريا الجنوبية
